package com.mirim.cheum_stac.Map;

import java.util.List;

public class StoreList {


    public static List<Store> storeList =
            List.of(
                    new Store(0, "1.5도씨", "서울특별시 관악구 조원로18길 15", 37.4835316, 126.9126295),
                    new Store(1, "가치쓰제이", "경상남도 밀양시 삼문송림길 5-7", 35.4877365, 128.7560629),
                    new Store(2, "갤러리딤", "서울특별시 영등포구 선유로3길 10 하우스디 비즈", 37.5164363, 126.8868107),
                    new Store(3, "기부나눔마켓 리본 옥포점", "경상남도 거제시 옥포로23길 5 영진그린빌라", 34.8952771, 128.6900421),
                    new Store(4, "대안생활 공기", "서울특별시 강동구 상암로3길 24 뱅크빌딩", 37.5510618, 127.1249265),
                    new Store(5, "대전신세계 Art&Science", "대전광역시 유성구 대덕대로 516 대전유성소방서", 36.3751677, 127.3819045),
                    new Store(6, "더 커먼", "대구광역시 중구 국채보상로140길 33", 35.8673994, 128.6063935),
                    new Store(7, "더현대서울-식품관", "서울특별시 영등포구 여의대로 108 파크원", 37.5258975, 126.9284261),
                    new Store(8, "덕분愛", "서울특별시 서초구 서초대로 389 진흥상가", 37.5026383, 127.0229664),
                    new Store(9, "도돌이상점", "경기도 시흥시 은계호수로 49 시흥 센트럴돔 그랑트리 캐슬", 37.44543130000017, 126.8020503999999),
                    new Store(10, "동그라미리필러리", "경기도 성남시 분당구 판교로33번길 9", 37.39023, 127.0843454),
                    new Store(11, "디어에코", "서울특별시 광진구 아차산로65길 22", 37.5412316, 127.093786),
                    new Store(12, "보틀앤스쿱", "서울특별시 마포구 대흥로24길 24", 37.55349819999966, 126.92996269999993),
                    new Store(13, "맹꽁이상점", "경기도 시흥시 하중로173번길 22", 37.39517220000024, 126.80028109999955),
                    new Store(14, "무해공간", "경기도 성남시 중원구 원터로105번길 5-1", 37.43579349999984, 127.13781019999944),
                    new Store(15, "물푸레북카페", "서울특별시 은평구 진관4로 48-51 은평뉴타운 상림마을", 37.6436341, 126.9295435),
                    new Store(16, "보틀라운지", "서울특별시 서대문구 홍연길 26", 37.5751488, 126.9284689),
                    new Store(17, "비그린(B:green)", "서울특별시 동작구 노량진로 10 여성가족복합시설 스페이스살림", 37.5126411, 126.9271976),
                    new Store(18, "비유비웰", "서울특별시 서초구 방배로42길 31-4 102호", 37.49471279999987, 126.98617529999933),
                    new Store(19, "솝리필스테이션", "경기도 성남시 수정구 위례광장로 21 가하빌딩", 37.46693, 127.141592),
                    new Store(20, "신세계백화점 본점", "서울특별시 중구 소공로 63 신세계백화점건물", 37.5611141, 126.9812404),
                    new Store(21, "싱글룸", "충청북도 청주시 상당구 중고개로141번길 14-2", 36.617503900000074, 127.51223829999951),
                    new Store(22, "아토모스", "서울특별시 성북구 성북로8길 11", 37.59109129999997, 127.00024329999951),
                    new Store(23, "에르마나스", "강원도 원주시 남원로469번길 14-2", 37.32799329999958, 127.93861699999952),
                    new Store(24, "올가홀푸드 방이점", "서울특별시 송파구 양재대로71길 4 올가홀푸드", 37.51039169999978, 127.12220329999998),
                    new Store(25, "용기내 담아가게", "경기도 남양주시 와부읍 덕소로97번길 9 일신프라자", 37.58611369999992, 127.2131738999997),
                    new Store(26, "용기상점", "강원도 삼척시 청석로 83-19", 37.44859440000003, 129.17377259999986),
                    new Store(27, "우슬레", "서울특별시 강동구 성안로 87", 37.5313332, 127.1322353),
                    new Store(28, "자원순환 환장", "서울특별시 강북구 인수봉로23길 37", 37.6275787, 127.0108167),
                    new Store(29, "제로스테이", "대구광역시 달서구 진천로 114-17", 35.8193337, 128.5223126),
                    new Store(30, "제로에이블", "경기도 안양시 동안구 동편로27번길 7", 37.4067135, 126.9722788),
                    new Store(31, "제이앤니들워크", "경기도 의정부시 용민로 419 (라디언트캐슬) 1204동 2103호", 37.755921, 127.1147296),
                    new Store(32, "지구랑 가게", "서울특별시 노원구 광운로 53 니아미트어린이집", 37.62242150000016, 127.05518709999998),
                    new Store(33, "지구샵 홈&베이커리 연남점", "서울특별시 마포구 성미산로 155", 37.5645561, 126.9235021),
                    new Store(34, "초록숲상점", "경기도 평택시 용죽6길 22", 36.99344439999993, 127.12426609999993),
                    new Store(35, "코뿔소책방", "경기도 김포시 김포한강11로438번길 123 하늘빛마을 한신더휴테라스", 37.6512804, 126.6951956),
                    new Store(36, "프렌들리랩", "서울특별시 구로구 구로중앙로 152 NC백화점", 37.501160200000065, 126.87858890000007),
                    new Store(37, "플래닛어스(Planet Us)", "인천광역시 연수구 인천타워대로 257 아트포레", 37.3936653, 126.6329588),
                    new Store(38, "함께그린협동조합(꼭꼭가게)", "충청남도 천안시 서북구 불당23로 73-27", 36.82042239999967, 127.10549769999997),
                    new Store(39, "핸드메이드라이프", "제주특별자치도 서귀포시 대정읍 상모로 256", 33.2240501, 126.2617836),
                    new Store(40, "허그어웨일", "서울특별시 강서구 화곡로55길 23", 37.5526993, 126.8483948),
                    new Store(41, "후곡녹색상점", "경기도 고양시 일산서구 후곡로 58 후곡마을3단지", 37.68202039999978, 126.76170879999977),
                    new Store(42, "알맹상점", "서울특별시 마포구 월드컵로 25길 47 3층", 37.557761, 126.9052787),
                    new Store(43, "알맹상점 리스테이션", "서울특별시 중구 한강대로 405, 서울역 4층 야외주차장 옥상정원 나무건물", 37.555042, 126.9695336)
            );


}