package com.mirim.cheum_stac.Product;

import com.mirim.cheum_stac.R;

import java.util.List;

public class ProductList {

    public static List<Product> productList =
        List.of(
                new Product(0, R.drawable.p0,"hair", "BEST [에디터픽]", "베이비 센시티브 샴푸 앤 바디워시", "100ml       1,500원", "아기 피부를 지켜주는 시어버터의 놀라운 힘!\n\n" +
                        "머리부터 발 끝까지 한 번에 사용할 수 있는 샴푸와 바디워시 겸용 제품. pH 4.8로 최적의 피부 상태를 유지할 수 있도록 도와주며, 피부에 순한 성분으로 만들어졌습니다. 저자극 테스트를 통과한 제품으로 거품이 적어 목욕시간을 효과적으로 단축시켜줍니다.\n\n" +
                        "알로에베라잎즙, 시어버터, 스쿠알란 등을 함유하여 수분을 채워주고 피부를 건강하게 보호하며, 비타민과 미네랄이 풍부한 호호바씨 오일을 통해 보습 효과 또한 놓치지 않았습니다. 피부 지질막과 유사한 성분으로 구성되어 있어 피부의 건조함을 해결해 주며, 피부 본연의 건강함을 되찾아 줍니다.",
                        "#유수분 밸런스 #신생아 #보습 #호호바씨오일"),
                new Product(1, R.drawable.p1, "body", "BEST [에디터픽]", "프롬 그라운드 내추럴 디쉬바", "100g       5000원", "화학성분 ZERO! 자연원료와 천연곡물을 사용해 예민한 피부도 맨손으로 설거지할 수 있도록 만들었습니다. 잔여물 없이 뽀득뽀득한 세척력을 자랑합니다. 천연 레몬오일을 사용하여 상큼함을 더했습니다. 자연분해 원리로 그릇에 잔류세제가 남지 않고 바로 사라집니다. \n\n" +
                        "유기농 코코넛오일과 유기농 사탕수수로 더욱 프리미엄하게. 맨손으로 설거지 후에도 촉촉하게 수분보습을 유지하세요!", "#강한 세척력 #거품 #화학성분 제로"),
                new Product(2, R.drawable.p2, "hair", "BEST [에디터픽]", "아로마티카 로즈마리 스칼프 샴푸바", "100g       8500원", "묵은 두피 각질 케어와 영양 공급으로 깨끗한 두피 환경을 만드는데 도움을 주는 두피 샴푸. 로즈마리 샴푸는 4년 연속 올리브영 어워즈 샴푸 부문에서 수상*받았습니다. 따뜻한 성질을 가진 로즈마리는 두피의 묵은 각질을 불려 쉽게 탈락할 수 있도록 돕고 지친 두피에 활력을 선사합니다. 프로바이오틱스, 카페인 성분이 균형감을 잃은 두피 밸런스를 맞춰주고 바이오틴, 판테놀, 아미노산 등 뿌리 영양 성분이 더해져 섬세한 영양 공급으로 뿌리 끝까지 탄탄한 건강모로 가꾸는데 도움을 줍니다. ", "#두피 강화 #모근 영양 #각질 정화&탈모기능성"),
                new Product(3, R.drawable.p3, "cos", "BEST [에디터픽]", "픽시 할로우 한방 클렌징 바", "100ml       3100원", "촉촉한 보습력으로 당김 없이 보들보들, 동의보감에 쓰인 아토피, 건선의 한방 연고 재료로 자초, 감초를 비롯한 15가지 한약재를 오랜 시간 우리고 숙성시켜 오일을 만듭니다. 정성과 시간이 들어간 오일로 만든 한방 클렌징 바는 향산화와 소염작용으로 피부 재생을 돕고 우리의 몸을 부드럽게 보호해 줍니다.", "#비건 한방 #보습 #피부 재생"),
                new Product(4, R.drawable.p4, "hair", "BEST [에디터픽]", "타이거릴리 네버우드 참숯 클렌징 바", "100ml       3100원", "대나무 참숯과 병풀 추출물로 노폐물 흡착과 피부 안정에 도움을 주는 ‘시들지 않는 나무(참숯병풀)’. 네버우드 클렌징바의 우디하고 시트러스한 향이 더 풍성해졌습니다. 식물성 원료로 만들어진 비건 비누인 시들지 않는 나무! 먹는 비건이 묵은 두피 각질 케어와 영양 공급으로 깨끗한 두피 환경을 만드는데 도움을 주는 두피 샴푸.\n\n" +
                        "로즈마리 샴푸는 4년 연속 올리브영 어워즈 샴푸 부문에서 수상*받았습니다. 따뜻한 성질을 가진 로즈마리는 두피의 묵은 각질을 불려 쉽게 탈락할 수 있도록 돕고 지친 두피에 활력을 선사합니다. 프로바이오틱스, 카페인 성분이 균형감을 잃은 두피 밸런스를 맞춰주고 바이오틴, 판테놀, 아미노산 등 뿌리 영양 성분이 더해져 섬세한 영양 공급으로 뿌리 끝까지 탄탄한 건강모로 가꾸는데 도움을 줍니다.", "#비건 #무자극 #각질 케어"),
                new Product(5, R.drawable.p5, "kit", "BEST [에디터픽]", "에코라운드 1종 주방세제", "100ml       600원", "과일, 야채를 세정하는 1종 세척제 성분의 안전한 원료!\n\n" +
                        "코코넛, 옥수수 등의 식물에서 추출한 자연유래 성분으로 잔여물이 남지 않는 젖병 및 유아식기 세정 겸용 주방세제로 사용할 수 있습니다. 저온생분해성 천연액상세정제 특허로 안심하고 사용하세요!", "#자연친화 #친환경 #그린라벨"),
                new Product(6, R.drawable.p6, "laund", "BEST [에디터픽]", "에코라운드 섬유유연제", "100ml       500원", "자연친화적인 원료와 방식을 통해섬유를 보호해 의류의 정전기와 주름을 방지합니다. 유해, 유려 성분이 무함유되어 있으며, 은은한 프리지아향으로 기분까지 편안해집니다.옷감의 부드럽고 포근한 감촉 유지를 위해 세탁 후 남은 잔류 성분을 깨끗이 제거합니다.", "#자연친화 #친환경 #그린라벨"),
                new Product(7, R.drawable.p7, "laund", "BEST [에디터픽]", "내츄럴 버블 세탁세제", "100ml       150원", "미세 플라스틱 걱정 없이 안심하고 사용하는 슈가버블 내추럴버블 세탁세제입니다. 코코넛과 옥수수에서 유래한 세정성분으로 자극 없이 부드럽게 세탁하실 수 있어요. \n\n" +
                        "할미꽃, 겐티아나뿌리, 칡뿌리, 쐐기풀잎, 파파야잎, 우스니아 추출물, 비누풀뿌리, 초피나무열매까지 8가지 천연 추출물 내추럴 버블 성분을 함유하고 있습니다. 단백질 분해효소 프로테아제를 첨가해 얼룩을 효과적으로 제거합니다. 안심하고 사용하는 자연의 깨끗함을 담은 친환경 세탁세제를 만나보세요.", "#친환경 #얼룩 제거"),
                new Product(8, R.drawable.p8, "laund", "BEST [에디터픽]", "스노우코튼 섬유유연제", "100ml       120원", "식물유래 세정성분'을 통해 친환경 섬유유연제. 식물유래 유연성분은 코코넛과 팜유 등 각종 식물에서 유래한 세정성분으로 만들어 환경에도 사람에도 자극과 오염에 대한 부담이 덜 합니다. 미세 플라스틱 검출 테스트, 26가지 알러지 물질 무첨가 테스트를 통과해 믿고 사용할 수 있습니다. \n\n" +
                        "오랫동안 지속되는 풍부한 향기, 매그놀리아와 뮤게향이 어우러져 부드럽고 포근한 코튼의 느낌으로 이어지는 설렘을 느껴보세요. ", "#친환경"),
                new Product(9, R.drawable.p9, "cos", "BEST [에디터픽]", "아로마티카 수딩 알로에 베라 젤", "100ml       1,988원", "코스모스 인증 알로에 베라 96%, 식물 유래 성분 99%\n" +
                        "외부로부터 자극받은 피부를 위한 진정 수분 젤. 수분 공급이 필요한 부위에 끈적임 없이 산뜻하게 수분을 더해줍니다.", "#수분 진정 #알로에 겔 #수딩 젤"),
                new Product(10, R.drawable.p10, "food", "BEST [에디터픽]", "켈로그 콘푸로스트", "100g       800원", "열풍을 순간적으로 불어 제품을 신속하게 구워내는 제트오븐 공법으로 바삭한 식감을 살린 콘푸로스트. 에너지 대사에 필요한 비타민 B군 함유, 11가지 비타민과 무기질로 균형 잡힌 한 끼를 챙겨보세요! ", "#식품")
        );
}
